---
kind: method
id: M:Autodesk.Revit.DB.TextNode.GetFormattedText
source: html/1786c219-a864-1444-9338-f33daddb16e3.htm
---
# Autodesk.Revit.DB.TextNode.GetFormattedText Method

Returns an FormattedText object that contains text and associated formatting of this TextNode.

## Syntax (C#)
```csharp
public FormattedText GetFormattedText()
```

## Returns
The object that contains the text and associated formatting of of the text in this text note.